Series

In [2]:
# Créer une série
import pandas as pd 
se = pd.Series([1, 2, 3, 4])
print(se)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
# Créer une Series avec un index
se_i = pd.Series([1, 2], index= ["a", "b"])
print(se_i)

a    1
b    2
dtype: int64

In [4]:
# Accéder à la valeur correspondant à un élément de l'index
se_i["a"]

1

In [5]:
# Re-indexer une série
se_i.reindex(["b", "a", "c"])

b    2.0
a    1.0
c    NaN
dtype: float64

DataFrame

In [18]:
# Créer un dataframe représentant les élèves avec trois colonnes
#   - prénom
#   - poste
#   - employeur

dict_eleves = {
    "prénom" : ["Alexandre", "Anaïs", "Louis-Dominique", "Roméo", "Baptiste", "Quentin"],
    "poste" : [1, 2, 3, 4, 5, 6],
    "employeur" : "Lecureur"
}

import pandas as pd 
df = pd.DataFrame(dict_eleves)
df

            prénom  poste employeur
0        Alexandre      1  Lecureur
1            Anaïs      2  Lecureur
2  Louis-Dominique      3  Lecureur
3            Roméo      4  Lecureur
4         Baptiste      5  Lecureur
5          Quentin      6  Lecureur

In [19]:
# Sur ce dernier df:
# créer une nouvelle colonne "niveau_python" et assigner à tout le monde la valeur "intermediaire"

#df["niveau_python"][df["poste"] < 3] = "intermédiaire" 
#df["niveau_python"][df["poste"] >= 3] = "expert"

df["niveau_python"] = df.apply(lambda x : "intermédiaire" if x["poste"]< 3 else "expert", axis =1)
df

            prénom  poste employeur  niveau_python
0        Alexandre      1  Lecureur  intermédiaire
1            Anaïs      2  Lecureur  intermédiaire
2  Louis-Dominique      3  Lecureur         expert
3            Roméo      4  Lecureur         expert
4         Baptiste      5  Lecureur         expert
5          Quentin      6  Lecureur         expert

In [20]:
# Reprendre le df des élèves
# A l'aide de la méthode .drop(), supprimer la colonne "niveau_python"

df.drop("niveau_python", axis = 1)

            prénom  poste employeur
0        Alexandre      1  Lecureur
1            Anaïs      2  Lecureur
2  Louis-Dominique      3  Lecureur
3            Roméo      4  Lecureur
4         Baptiste      5  Lecureur
5          Quentin      6  Lecureur